lemrefeofficial/SelfCommissioningSitara/universal_motorcontrol_am263x_r5fss0-0_nortos_ti-arm-clang/src_board/AM263_HVMTRPFC.syscfg
gpio4.$name                = "CONFIG_HALL_U_GPIO";
gpio4.GPIO.gpioPin.qualSel = "3sample";
gpio4.GPIO.gpioPin.$assign = "SPI1_D0";

gpio5.$name                = "CONFIG_HALL_V_GPIO";
gpio5.GPIO.gpioPin.qualSel = "3sample";
gpio5.GPIO.gpioPin.$assign = "SPI1_D1";

gpio6.$name                = "CONFIG_HALL_W_GPIO";
gpio6.GPIO.gpioPin.qualSel = "3sample";
gpio6.GPIO.gpioPin.$assign = "SPI1_CLK";

gpio7.pinDir               = "OUTPUT";
gpio7.$name                = "CONFIG_GATE_EN_GPIO";
gpio7.GPIO.gpioPin.pu_pd   = "pu";
gpio7.GPIO.gpioPin.$assign = "EPWM4_B";

i2c1.$name           = "CONFIG_I2C0";
i2c1.enableIntr      = false;
i2c1.I2C.$assign     = "I2C2";
i2c1.I2C.SCL.$assign = "UART0_RTSn";
i2c1.I2C.SDA.$assign = "UART0_CTSn";

mcan1.$name = "CONFIG_MCAN0";

mcspi1.$name                       = "CONFIG_MCSPI0";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI0";
mcspi1.SPI.CLK.$assign             = "SPI0_CLK";
mcspi1.SPI.D0.$assign              = "SPI0_D0";
mcspi1.SPI.D1.$assign              = "SPI0_D1";
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].frameFormat = "POL0_PHA1";
mcspi1.mcspiChannel[0].bitRate     = 4000000;
mcspi1.mcspiChannel[0].CSn.$assign = "SPI0_CS0";

mcspi2.$name                       = "CONFIG_MCSPI1";
mcspi2.intrEnable                  = "POLLED";
mcspi2.SPI.$assign                 = "SPI1";
mcspi2.SPI.CLK.$assign             = "SPI1_CLK";
mcspi2.SPI.CLK.$used               = false;
mcspi2.SPI.D0.$assign              = "SPI1_D0";
mcspi2.SPI.D0.$used                = false;
mcspi2.SPI.D1.$assign              = "SPI1_D1";
mcspi2.SPI.D1.$used                = false;
mcspi2.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH1";
mcspi2.mcspiChannel[0].bitRate     = 4000000;
mcspi2.mcspiChannel[0].CSn.$assign = "SPI1_CS0";

edma1.$name                 = "CONFIG_EDMA0";
mcspi1.edmaDriver           = edma1;
mcspi2.edmaDriver           = edma1;
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

uart1.$name            = "CONFIG_UART2";
uart1.UART.$assign     = "UART2";
uart1.UART.RXD.$assign = "LIN2_RXD";
uart1.UART.RXD.$used   = false;
uart1.UART.TXD.$assign = "LIN2_TXD";
uart1.UART.TXD.$used   = false;

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART1";
debug_log.uartLog.UART.$assign     = "UART1";
debug_log.uartLog.UART.RXD.$assign = "UART1_RXD";
debug_log.uartLog.UART.RXD.$used   = false;
debug_log.uartLog.UART.TXD.$assign = "UART1_TXD";
debug_log.uartLog.UART.TXD.$used   = false;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x50D00000;
mpu_armv75.size         = 14;
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr     = 0x72000000;
mpu_armv76.size         = 14;
mpu_armv76.allowExecute = false;
mpu_armv76.attributes   = "NonCached";

timer1.startTimer  = true;
timer1.$name       = "CPU_DIAGNOSTICS_TIMER0";
timer1.enableIntr  = false;
timer1.RTI.$assign = "RTI1";

epwm_xbar1.$name      = "MTR1_IS_TRIP_CMPSS";
epwm_xbar1.xbarOutput = ["CMPSSB1_CTRIPH","CMPSSB1_CTRIPL","CMPSSB3_CTRIPH","CMPSSB3_CTRIPL"];
epwm_xbar1.instance   = "EPWM_XBAR_6";

input_xbar1.$name      = "CONFIG_CAP_U_XBAR";
input_xbar1.instance   = "INPUT_XBAR_4";
input_xbar1.xbarOutput = "GPIO17";

input_xbar2.$name      = "CONFIG_CAP_V_XBAR";
input_xbar2.instance   = "INPUT_XBAR_5";
input_xbar2.xbarOutput = "GPIO18";

input_xbar3.$name      = "CONFIG_CAP_W_XBAR";
input_xbar3.instance   = "INPUT_XBAR_6";
input_xbar3.xbarOutput = "GPIO16";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC0_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN5.$suggestSolution      = "ADC0_AIN5";
adc2.ADC.AIN3.$suggestSolution      = "ADC1_AIN3";
adc2.ADC.AIN4.$suggestSolution      = "ADC1_AIN4";
adc2.ADC.AIN5.$suggestSolution      = "ADC1_AIN5";
adc3.ADC.AIN0.$suggestSolution      = "ADC3_AIN0";
adc3.ADC.AIN1.$suggestSolution      = "ADC3_AIN1";
adc4.ADC.AIN4.$suggestSolution      = "ADC4_AIN4";
epwm1.EPWM.A.$suggestSolution       = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution       = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution       = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution       = "EPWM1_B";
epwm3.EPWM.A.$suggestSolution       = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution       = "EPWM2_B";
epwm4.EPWM.A.$suggestSolution       = "EPWM5_A";
epwm4.EPWM.B.$suggestSolution       = "EPWM5_B";
epwm5.EPWM.A.$suggestSolution       = "EPWM6_A";
epwm5.EPWM.B.$suggestSolution       = "EPWM6_B";
gpio1.GPIO.$suggestSolution         = "GPIO0";
gpio1.GPIO.gpioPin.$suggestSolution = "QSPI_CLK";
gpio2.GPIO.$suggestSolution         = "GPIO0";
gpio2.GPIO.gpioPin.$suggestSolution = "QSPI_CSn1";
gpio3.GPIO.$suggestSolution         = "GPIO0";
gpio3.GPIO.gpioPin.$suggestSolution = "QSPI_CSn0";
gpio4.GPIO.$suggestSolution         = "GPIO0";
gpio5.GPIO.$suggestSolution         = "GPIO0";
gpio6.GPIO.$suggestSolution         = "GPIO0";
gpio7.GPIO.$suggestSolution         = "GPIO0";
mcan1.MCAN.$suggestSolution         = "MCAN0";
mcan1.MCAN.RX.$suggestSolution      = "MCAN0_RX";
mcan1.MCAN.TX.$suggestSolution      = "MCAN0_TX";
